In [ ]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#Create a mew dataframe from a python dictionary
data = {
    'Name': ['John', 'Jane', 'Michael', 'Emily', 'David'],
    'Math': [85, 92, 78, np.nan, 88], #Notice that Emily's Math score is null
    'Science': [78, 45, 85, 91, 82] #There is a failing score in the science column
}

df = pd.DataFrame(data);

df

      Name  Math  Science
0     John  85.0       78
1     Jane  92.0       45
2  Michael  78.0       85
3    Emily   NaN       91
4    David  88.0       82

In [ ]:
#descriptive statistics on the data
df.describe()

            Math    Science
count   4.000000   5.000000
mean   85.750000  76.200000
std     5.909033  18.074844
min    78.000000  45.000000
25%    83.250000  78.000000
50%    86.500000  82.000000
75%    89.000000  85.000000
max    92.000000  91.000000

In [4]:
#Accessing a specific column
math_column = df['Math']
science_column = df['Science']

math_column

0    85.0
1    92.0
2    78.0
3     NaN
4    88.0
Name: Math, dtype: float64

In [5]:
#filter the data
failing_science = df[df['Science'] < 50]

failing_science

   Name  Math  Science
1  Jane  92.0       45